app/views/quizzes/_form.html.erb

      <%= builder.hidden_field :question_id, :value => "#{aquestion.question.id}" %>
      <% aquestion.question.answers.each do |a| %>
---
SELECT "answers".* FROM "answers" WHERE ("answers".question_id = 1)
SELECT "questions".* FROM "questions" WHERE "questions"."id" = 7 LIMIT 1