app/controllers/areas_controller.rb

  def index
    @areas = Area.all
---
SELECT "areas".* FROM "areas"

  def show
    @area = Area.find(params[:id])
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 1 LIMIT 1

  def create
    @area = Area.new(params[:area])

    respond_to do |format|
      if @area.save
---
INSERT INTO "areas" ("created_at", "updated_at", "nombre") VALUES ('2011-04-28 00:03:52.838658', '2011-04-28 00:03:52.838658', 'Probando')