app/controllers/courses_controller.rb

SELECT "areas".* FROM "areas" WHERE "areas"."nombre" = 'Y asi'
INSERT INTO "courses" ("nombre", "area_id", "updated_at", "created_at") VALUES ('Pruebas 2 y asi', 70136958368760, '2011-04-28 00:11:00.770697', '2011-04-28 00:11:00.770697')
---
  def create
    @course = Course.new(params[:course])
    areastring = params[:area]

    a=Area.where(:nombre => areastring)
        @course.area_id=a[0].id

    respond_to do |format|
      if @course.save