app/controllers/questions_controller.rb

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("content", "correct_answer", "created_at", "updated_at") VALUES ('nose?', 1, '2011-03-18 01:50:52.163237', '2011-03-18 01:50:52.163237')

  def update
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = 1 LIMIT 1