app/controllers/quizzes_controller.rb

SELECT "questions".* FROM "questions" LIMIT 1 OFFSET 0
---
  def new
    @quiz = Quiz.new
    @ques = Question.random

    @ques.each do |a|