app/controllers/registrations_controller.rb

INSERT INTO "users" ("numero_de_poliza", "email_personal", "telefono_celular", "remember_created_at", "updated_at", "current_sign_in_ip", "contacto_emergencia", "sign_in_count", "promedio_global_acumulado", "last_sign_in_at", "telefono_particular", "nombre_del_seguro", "password_salt", "nombre", "fecha_de_vencimiento", "major_id", "matricula", "admin", "apellido_paterno", "sexo", "reset_password_token", "remember_token", "encrypted_password", "current_sign_in_at", "semestre", "last_sign_in_ip", "promedio_del_semestre_anterior", "compania", "email", "telefono_emergencia", "parentesco", "apellido_materno", "created_at") VALUES ('sdf3', 'safs@ok.com', '81818181', NULL, '2011-04-28 13:28:42.211348', NULL, 'werew', 0, 88, NULL, '81818181', 'df', '$2a$10$w3bFL7tEzcw/TRaWZrG4/e', 'Jorge', NULL, NULL, '1087740', NULL, 'Blanco', 'Hombre', NULL, NULL, '$2a$10$w3bFL7tEzcw/TRaWZrG4/eQRqO04jl.nYQprlrCAU4w3xS1UGAd1W', NULL, 1, NULL, 88, 'sdf', 'a010@a010.com', '3243', 'ewrwer', 'Segura', '2011-04-28 13:28:42.211348')
---
    def create
        @user = User.new(params[:user])
        semes = params[:semestre]
            @user.semestre=semes

        respond_to do |format|
          if @user.save